Notes/emacs-cheatsheet.org
#+TITLE: Emacs cheatsheet
#+AUTHOR: Thibault Polge
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="emacs-cheatsheet.css" />
#+OPTIONS: num:nil toc:1

* Command multipliers


| =C--= =M--=             | Negative argument  |
| =C-u=                 | Universal argument |

#+begin_hint
  *Digit argument* is =M= or =C= followed by any number.
#+end_hint

* Moving around

|     |   |                             |
|-----+---+-----------------------------|
| =C-f= | → | Char                        |
| =C-b= | ← | Char                        |
|-----+---+-----------------------------|
| =M-f= | → | Word                        |
| =M-b= | ← | Word                        |
|-----+---+-----------------------------|
| =C-n= | ↓ | Line                        |
| =C-p= | ↑ | Line                        |
| =C-a= | ⇤ | Line                        |
| =M-m= | ⇤ | Line (first non-whitespace) |
| =C-e= | ⇥ | Line                        |
|-----+---+-----------------------------|
| =M-e= | → | Sentence                    |
| =M-a= | ← | Sentence                    |
|-----+---+-----------------------------|
| =M-<= | ⇱ | Buffer                      |
| =M->= | ⇲ | Buffer                      |

** Go to

| =M-g c= | nth character  |
| =M-g g= | Line           |
| =M-g n= | Next error     |
| =M-g p= | Previous error |

* Moving around (semantic)

|       |   |           |
|-------+---+-----------|
| =C-M-f= | → | Sexp      |
| =C-M-b= | ← | Sexp      |
|-------+---+-----------|
| =C-M-d= | ↓ | List      |
| =C-M-u= | ↑ | List      |
| =C-M-n= | → | List      |
| =C-M-p= | ← | List      |
|-------+---+-----------|
| =M-}=   | → | Paragraph |
| =M-{=   | ← | Paragraph |

* Scrolling

** Up and down

| =M-<=     |   |
| =M->=     |   |
| =C-v=     |   |
| =M-v=     |   |
| =C-M-v=   |   |
| =C-M-S-v= |   |

** Left and right

| =C-x <=, =C-<left>=  |   |
| =C-x >=, =C-<prior>= |   |

* Marks and regions

| =C-space= =C-@= | Set mark                |
| =C-x C-x=     | Exchange point and mark |
| =M-h=         | Mark paragraph          |
| =C-x C-p=     | Mark page               |
| =C-x h=       | Mark all buffer

* Killing and yanking

** Killing


|---------+---+----------|
| =C-d=     |   | Char     |
| =Del=     | ← | Char     |
|---------+---+----------|
| =M-d=     |   | Word     |
| =M-del=   | ← | Word     |
|---------+---+----------|
| =C-k=     |   | Line     |
|---------+---+----------|
| =M-k=     |   | Sentence |
| =C-x Del= | ← | Sentence |
|---------+---+----------|
| =C-w=     |   | Region   |

** Killing semantic units

| =C-M-k= | ~kill-sexp~ |

** Saving to kill-ring

| =M-w=     | ~kill-ring-save~          |

** Yanking

| =C-y=     | ~yank~                    |
| =M-y=     | ~yank-pop~                |

* Bookmarks and registers

** Bookmarks

| =C-x r m= | Set a bookmark   |
| =C-x r l= | List bookmarks   |
| =C-x r b= | Jump to bookmark |

** Registers

| =C-x r n=   | Store number                 |
| =C-x r s=   | Store region                 |
| =C-x r SPC= | Store point                  |
| =C-x r +=   | Increment number in register |
| =C-x r j=   | Jump to register             |
| =C-x r i=   | Insert contents of register  |
| =C-x r f=   | Store frameset               |
| =C-x r w=   | Store window configuration   |



* Editing goodies

** Transposition

| =C-t=     | Chars           |
| =M-t=     | Words           |
| =C-M-t=   | Sexps           |
| =C-x C-t= | Lines           |

** Case

| =M-c=     | Capitalize word |
| =M-u=     | Convert word to uppercase
| =M-l=     | Convert word to lowercase |

* Searching

| =C-s=     | ~isearch-forward~         |
| =C-r=     | ~isearch-backward~        |
| =C-s C-w= | ~isearch-yank-word~       |
| =C-s C-y= | ~isearch-yank-line~       |
| =C-s M-y= | ~isearch-yank-kill~       |
| =C-s C-s= | ~isearch-repeat-forward~  |
| =C-s C-r= | ~isearch-repeat-backward~ |
| =C-M-s=   | ~isearch-forward-regexp~  |
| =C-M-r=   | ~isearch-backward-regexp~ |
| =M-s w=   | ~isearch-forward-word~    |

** At search prompt

| =Enter= | ~isearch-exit~ |

** Swiper

| =M-q= | ~swiper-query-replace~ |
| =C-o= | ~hydra-ivy/body~       |

* Replacing

| =M-%=   | ~query-replace~        |
| =C-M-%= | ~query-replace-regexp~ |

** At replace prompt

| =C-r= | Enter recursive edit            |
| =C-w= | Delete match and recursive edit |
| =^=   | Go back to previous match       |
| =E=   | Edit replacement string         |

* Macros

| =C-x (= =<f3>= | ~kmacro-start-macro~         |
| =C-x )= =<f4>= | ~kmacro-end-macro~           |
| =C-x e=      | ~kmacro-end-and-call-macro~  |
| =C-x C-k r=  | ~apply-macro-to-region-line~ |

#+begin_hint
To loop a macro until error or end of buffer, call it with 0 as a numeric argument.
#+end_hint


* Debugging

** CPU/RAM Usage

  | ∅  | ~profiler-start~  |
  | ∅  | ~profiler-report~ |

** Weird errors

| ∅ | ~toggle-debug-on-error~ |
| ∅ | ~toggle-debug-on-quit~  |

#+begin_hint
  To rescue a unresponsive Emacs, =kill -s USR2 [pid]= or =killall -s USR2 emacs=.
#+end_hint




* Misc

#+begin_hint
Paragraph
 * ~subword-mode~ and ~superword-mode~ treat =snake_case= and =CamelCase=, respectively, as distinct words.  ~glasses-mode~ /visually/ separates CamelCased words: =Camel_Cased=.
 * See ~paragraph-indent-minor-mode~
#+end_hint
