Notes/emacs-cheatsheet.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-12-13 mar. 19:20 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Emacs cheatsheet</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Thibault Polge" />
<link rel="stylesheet" type="text/css" href="emacs-cheatsheet.css" />
</head>
<body>
<div id="content">
<h1 class="title">Emacs cheatsheet</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org8ac4483">Command multipliers</a></li>
<li><a href="#org7c13f37">Moving around</a></li>
<li><a href="#org8177b91">Moving around (semantic)</a></li>
<li><a href="#org72b4b65">Scrolling</a></li>
<li><a href="#org3e10b97">Marks and regions</a></li>
<li><a href="#org14b4033">Killing and yanking</a></li>
<li><a href="#org1879d08">Bookmarks and registers</a></li>
<li><a href="#org413399d">Editing goodies</a></li>
<li><a href="#orga39c349">Searching</a></li>
<li><a href="#orgf21bfff">Replacing</a></li>
<li><a href="#org8371949">Macros</a></li>
<li><a href="#org01d5e9b">Debugging</a></li>
<li><a href="#org7fead72">Misc</a></li>
</ul>
</div>
</div>

<div id="outline-container-org8ac4483" class="outline-2">
<h2 id="org8ac4483">Command multipliers</h2>
<div class="outline-text-2" id="text-org8ac4483">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><code>C--</code> <code>M--</code></td>
<td class="org-left">Negative argument</td>
</tr>

<tr>
<td class="org-left"><code>C-u</code></td>
<td class="org-left">Universal argument</td>
</tr>
</tbody>
</table>

<div class="hint">
<p>
<b>Digit argument</b> is <code>M</code> or <code>C</code> followed by any number.
</p>

</div>
</div>
</div>

<div id="outline-container-org7c13f37" class="outline-2">
<h2 id="org7c13f37">Moving around</h2>
<div class="outline-text-2" id="text-org7c13f37">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>C-f</code></td>
<td class="org-left">→</td>
<td class="org-left">Char</td>
</tr>

<tr>
<td class="org-left"><code>C-b</code></td>
<td class="org-left">←</td>
<td class="org-left">Char</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><code>M-f</code></td>
<td class="org-left">→</td>
<td class="org-left">Word</td>
</tr>

<tr>
<td class="org-left"><code>M-b</code></td>
<td class="org-left">←</td>
<td class="org-left">Word</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><code>C-n</code></td>
<td class="org-left">↓</td>
<td class="org-left">Line</td>
</tr>

<tr>
<td class="org-left"><code>C-p</code></td>
<td class="org-left">↑</td>
<td class="org-left">Line</td>
</tr>

<tr>
<td class="org-left"><code>C-a</code></td>
<td class="org-left">⇤</td>
<td class="org-left">Line</td>
</tr>

<tr>
<td class="org-left"><code>M-m</code></td>
<td class="org-left">⇤</td>
<td class="org-left">Line (first non-whitespace)</td>
</tr>

<tr>
<td class="org-left"><code>C-e</code></td>
<td class="org-left">⇥</td>
<td class="org-left">Line</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><code>M-e</code></td>
<td class="org-left">→</td>
<td class="org-left">Sentence</td>
</tr>

<tr>
<td class="org-left"><code>M-a</code></td>
<td class="org-left">←</td>
<td class="org-left">Sentence</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><code>M-&lt;</code></td>
<td class="org-left">⇱</td>
<td class="org-left">Buffer</td>
</tr>

<tr>
<td class="org-left"><code>M-&gt;</code></td>
<td class="org-left">⇲</td>
<td class="org-left">Buffer</td>
</tr>
</tbody>
</table>
</div>

<div id="outline-container-org55152c1" class="outline-3">
<h3 id="org55152c1">Go to</h3>
<div class="outline-text-3" id="text-org55152c1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><code>M-g c</code></td>
<td class="org-left">nth character</td>
</tr>

<tr>
<td class="org-left"><code>M-g g</code></td>
<td class="org-left">Line</td>
</tr>

<tr>
<td class="org-left"><code>M-g n</code></td>
<td class="org-left">Next error</td>
</tr>

<tr>
<td class="org-left"><code>M-g p</code></td>
<td class="org-left">Previous error</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-org8177b91" class="outline-2">
<h2 id="org8177b91">Moving around (semantic)</h2>
<div class="outline-text-2" id="text-org8177b91">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>C-M-f</code></td>
<td class="org-left">→</td>
<td class="org-left">Sexp</td>
</tr>

<tr>
<td class="org-left"><code>C-M-b</code></td>
<td class="org-left">←</td>
<td class="org-left">Sexp</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><code>C-M-d</code></td>
<td class="org-left">↓</td>
<td class="org-left">List</td>
</tr>

<tr>
<td class="org-left"><code>C-M-u</code></td>
<td class="org-left">↑</td>
<td class="org-left">List</td>
</tr>

<tr>
<td class="org-left"><code>C-M-n</code></td>
<td class="org-left">→</td>
<td class="org-left">List</td>
</tr>

<tr>
<td class="org-left"><code>C-M-p</code></td>
<td class="org-left">←</td>
<td class="org-left">List</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><code>M-}</code></td>
<td class="org-left">→</td>
<td class="org-left">Paragraph</td>
</tr>

<tr>
<td class="org-left"><code>M-{</code></td>
<td class="org-left">←</td>
<td class="org-left">Paragraph</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org72b4b65" class="outline-2">
<h2 id="org72b4b65">Scrolling</h2>
<div class="outline-text-2" id="text-org72b4b65">
</div><div id="outline-container-org28ad9da" class="outline-3">
<h3 id="org28ad9da">Up and down</h3>
<div class="outline-text-3" id="text-org28ad9da">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><code>M-&lt;</code></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>M-&gt;</code></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>C-v</code></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>M-v</code></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>C-M-v</code></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>C-M-S-v</code></td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgebf020a" class="outline-3">
<h3 id="orgebf020a">Left and right</h3>
<div class="outline-text-3" id="text-orgebf020a">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><code>C-x &lt;</code>, <code>C-&lt;left&gt;</code></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>C-x &gt;</code>, <code>C-&lt;prior&gt;</code></td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-org3e10b97" class="outline-2">
<h2 id="org3e10b97">Marks and regions</h2>
<div class="outline-text-2" id="text-org3e10b97">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><code>C-space</code> <code>C-@</code></td>
<td class="org-left">Set mark</td>
</tr>

<tr>
<td class="org-left"><code>C-x C-x</code></td>
<td class="org-left">Exchange point and mark</td>
</tr>

<tr>
<td class="org-left"><code>M-h</code></td>
<td class="org-left">Mark paragraph</td>
</tr>

<tr>
<td class="org-left"><code>C-x C-p</code></td>
<td class="org-left">Mark page</td>
</tr>

<tr>
<td class="org-left"><code>C-x h</code></td>
<td class="org-left">Mark all buffer</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org14b4033" class="outline-2">
<h2 id="org14b4033">Killing and yanking</h2>
<div class="outline-text-2" id="text-org14b4033">
</div><div id="outline-container-orge502ecb" class="outline-3">
<h3 id="orge502ecb">Killing</h3>
<div class="outline-text-3" id="text-orge502ecb">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left"><code>C-d</code></th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">Char</th>
</tr>

<tr>
<th scope="col" class="org-left"><code>Del</code></th>
<th scope="col" class="org-left">←</th>
<th scope="col" class="org-left">Char</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>M-d</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Word</td>
</tr>

<tr>
<td class="org-left"><code>M-del</code></td>
<td class="org-left">←</td>
<td class="org-left">Word</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><code>C-k</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Line</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><code>M-k</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Sentence</td>
</tr>

<tr>
<td class="org-left"><code>C-x Del</code></td>
<td class="org-left">←</td>
<td class="org-left">Sentence</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><code>C-w</code></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Region</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org15ad16c" class="outline-3">
<h3 id="org15ad16c">Killing semantic units</h3>
<div class="outline-text-3" id="text-org15ad16c">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><code>C-M-k</code></td>
<td class="org-left"><code>kill-sexp</code></td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org29b88f8" class="outline-3">
<h3 id="org29b88f8">Saving to kill-ring</h3>
<div class="outline-text-3" id="text-org29b88f8">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><code>M-w</code></td>
<td class="org-left"><code>kill-ring-save</code></td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org65c28f8" class="outline-3">
<h3 id="org65c28f8">Yanking</h3>
<div class="outline-text-3" id="text-org65c28f8">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><code>C-y</code></td>
<td class="org-left"><code>yank</code></td>
</tr>

<tr>
<td class="org-left"><code>M-y</code></td>
<td class="org-left"><code>yank-pop</code></td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-org1879d08" class="outline-2">
<h2 id="org1879d08">Bookmarks and registers</h2>
<div class="outline-text-2" id="text-org1879d08">
</div><div id="outline-container-org05c7ad1" class="outline-3">
<h3 id="org05c7ad1">Bookmarks</h3>
<div class="outline-text-3" id="text-org05c7ad1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><code>C-x r m</code></td>
<td class="org-left">Set a bookmark</td>
</tr>

<tr>
<td class="org-left"><code>C-x r l</code></td>
<td class="org-left">List bookmarks</td>
</tr>

<tr>
<td class="org-left"><code>C-x r b</code></td>
<td class="org-left">Jump to bookmark</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgfd155a5" class="outline-3">
<h3 id="orgfd155a5">Registers</h3>
<div class="outline-text-3" id="text-orgfd155a5">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><code>C-x r n</code></td>
<td class="org-left">Store number</td>
</tr>

<tr>
<td class="org-left"><code>C-x r s</code></td>
<td class="org-left">Store region</td>
</tr>

<tr>
<td class="org-left"><code>C-x r SPC</code></td>
<td class="org-left">Store point</td>
</tr>

<tr>
<td class="org-left"><code>C-x r +</code></td>
<td class="org-left">Increment number in register</td>
</tr>

<tr>
<td class="org-left"><code>C-x r j</code></td>
<td class="org-left">Jump to register</td>
</tr>

<tr>
<td class="org-left"><code>C-x r i</code></td>
<td class="org-left">Insert contents of register</td>
</tr>

<tr>
<td class="org-left"><code>C-x r f</code></td>
<td class="org-left">Store frameset</td>
</tr>

<tr>
<td class="org-left"><code>C-x r w</code></td>
<td class="org-left">Store window configuration</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>



<div id="outline-container-org413399d" class="outline-2">
<h2 id="org413399d">Editing goodies</h2>
<div class="outline-text-2" id="text-org413399d">
</div><div id="outline-container-org9f028bf" class="outline-3">
<h3 id="org9f028bf">Transposition</h3>
<div class="outline-text-3" id="text-org9f028bf">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><code>C-t</code></td>
<td class="org-left">Chars</td>
</tr>

<tr>
<td class="org-left"><code>M-t</code></td>
<td class="org-left">Words</td>
</tr>

<tr>
<td class="org-left"><code>C-M-t</code></td>
<td class="org-left">Sexps</td>
</tr>

<tr>
<td class="org-left"><code>C-x C-t</code></td>
<td class="org-left">Lines</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgd543268" class="outline-3">
<h3 id="orgd543268">Case</h3>
<div class="outline-text-3" id="text-orgd543268">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><code>M-c</code></td>
<td class="org-left"><code>capitalize-word</code></td>
</tr>

<tr>
<td class="org-left"><code>M-u</code></td>
<td class="org-left"><code>upcase-word</code></td>
</tr>

<tr>
<td class="org-left"><code>M-l</code></td>
<td class="org-left"><code>downcase-word</code></td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-orga39c349" class="outline-2">
<h2 id="orga39c349">Searching</h2>
<div class="outline-text-2" id="text-orga39c349">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><code>C-s</code></td>
<td class="org-left"><code>isearch-forward</code></td>
</tr>

<tr>
<td class="org-left"><code>C-r</code></td>
<td class="org-left"><code>isearch-backward</code></td>
</tr>

<tr>
<td class="org-left"><code>C-s C-w</code></td>
<td class="org-left"><code>isearch-yank-word</code></td>
</tr>

<tr>
<td class="org-left"><code>C-s C-y</code></td>
<td class="org-left"><code>isearch-yank-line</code></td>
</tr>

<tr>
<td class="org-left"><code>C-s M-y</code></td>
<td class="org-left"><code>isearch-yank-kill</code></td>
</tr>

<tr>
<td class="org-left"><code>C-s C-s</code></td>
<td class="org-left"><code>isearch-repeat-forward</code></td>
</tr>

<tr>
<td class="org-left"><code>C-s C-r</code></td>
<td class="org-left"><code>isearch-repeat-backward</code></td>
</tr>

<tr>
<td class="org-left"><code>C-M-s</code></td>
<td class="org-left"><code>isearch-forward-regexp</code></td>
</tr>

<tr>
<td class="org-left"><code>C-M-r</code></td>
<td class="org-left"><code>isearch-backward-regexp</code></td>
</tr>

<tr>
<td class="org-left"><code>M-s w</code></td>
<td class="org-left"><code>isearch-forward-word</code></td>
</tr>
</tbody>
</table>
</div>

<div id="outline-container-org3c5a661" class="outline-3">
<h3 id="org3c5a661">At search prompt</h3>
<div class="outline-text-3" id="text-org3c5a661">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><code>Enter</code></td>
<td class="org-left"><code>isearch-exit</code></td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orga09d058" class="outline-3">
<h3 id="orga09d058">Swiper</h3>
<div class="outline-text-3" id="text-orga09d058">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><code>M-q</code></td>
<td class="org-left"><code>swiper-query-replace</code></td>
</tr>

<tr>
<td class="org-left"><code>C-o</code></td>
<td class="org-left"><code>hydra-ivy/body</code></td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-orgf21bfff" class="outline-2">
<h2 id="orgf21bfff">Replacing</h2>
<div class="outline-text-2" id="text-orgf21bfff">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><code>M-%</code></td>
<td class="org-left"><code>query-replace</code></td>
</tr>

<tr>
<td class="org-left"><code>C-M-%</code></td>
<td class="org-left"><code>query-replace-regexp</code></td>
</tr>
</tbody>
</table>
</div>

<div id="outline-container-orga1ddef1" class="outline-3">
<h3 id="orga1ddef1">At replace prompt</h3>
<div class="outline-text-3" id="text-orga1ddef1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><code>C-r</code></td>
<td class="org-left">Enter recursive edit</td>
</tr>

<tr>
<td class="org-left"><code>C-w</code></td>
<td class="org-left">Delete match and recursive edit</td>
</tr>

<tr>
<td class="org-left"><code>^</code></td>
<td class="org-left">Go back to previous match</td>
</tr>

<tr>
<td class="org-left"><code>E</code></td>
<td class="org-left">Edit replacement string</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-org8371949" class="outline-2">
<h2 id="org8371949">Macros</h2>
<div class="outline-text-2" id="text-org8371949">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><code>C-x (</code> <code>&lt;f3&gt;</code></td>
<td class="org-left"><code>kmacro-start-macro</code></td>
</tr>

<tr>
<td class="org-left"><code>C-x )</code> <code>&lt;f4&gt;</code></td>
<td class="org-left"><code>kmacro-end-macro</code></td>
</tr>

<tr>
<td class="org-left"><code>C-x e</code></td>
<td class="org-left"><code>kmacro-end-and-call-macro</code></td>
</tr>

<tr>
<td class="org-left"><code>C-x C-k r</code></td>
<td class="org-left"><code>apply-macro-to-region-line</code></td>
</tr>
</tbody>
</table>

<div class="hint">
<p>
To loop a macro until error or end of buffer, call it with 0 as a numeric argument.
</p>

</div>
</div>
</div>


<div id="outline-container-org01d5e9b" class="outline-2">
<h2 id="org01d5e9b">Debugging</h2>
<div class="outline-text-2" id="text-org01d5e9b">
</div><div id="outline-container-org73b0c2c" class="outline-3">
<h3 id="org73b0c2c">CPU/RAM Usage</h3>
<div class="outline-text-3" id="text-org73b0c2c">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">∅</td>
<td class="org-left"><code>profiler-start</code></td>
</tr>

<tr>
<td class="org-left">∅</td>
<td class="org-left"><code>profiler-report</code></td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orge8fb4d2" class="outline-3">
<h3 id="orge8fb4d2">Weird errors</h3>
<div class="outline-text-3" id="text-orge8fb4d2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">∅</td>
<td class="org-left"><code>toggle-debug-on-error</code></td>
</tr>

<tr>
<td class="org-left">∅</td>
<td class="org-left"><code>toggle-debug-on-quit</code></td>
</tr>
</tbody>
</table>

<div class="hint">
<p>
To rescue a unresponsive Emacs, <code>kill -s USR2 [pid]</code> or <code>killall -s USR2 emacs</code>.
</p>

</div>
</div>
</div>
</div>




<div id="outline-container-org7fead72" class="outline-2">
<h2 id="org7fead72">Misc</h2>
<div class="outline-text-2" id="text-org7fead72">
<div class="hint">
<p>
Paragraph
</p>
<ul class="org-ul">
<li><code>subword-mode</code> and <code>superword-mode</code> treat <code>snake_case</code> and <code>CamelCase</code>, respectively, as distinct words.  <code>glasses-mode</code> <i>visually</i> separates CamelCased words: <code>Camel_Cased</code>.</li>
<li>See <code>paragraph-indent-minor-mode</code></li>
</ul>

</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Thibault Polge</p>
<p class="date">Created: 2016-12-13 mar. 19:20</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
